{"format": "layers-model", "modelTopology": {"class_name": "Sequential", "config": {"name": "sequential", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 224, 224, 3], "dtype": "float32"}}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "gap", "trainable": false}}, {"class_name": "Dense", "config": {"name": "dense", "units": 1, "activation": "sigmoid", "trainable": true}}]}}, "weightsManifest": [{"paths": ["weights.bin"], "weights": [{"name": "dense/kernel", "shape": [3, 1], "dtype": "float32"}, {"name": "dense/bias", "shape": [1], "dtype": "float32"}]}]}